Revit 2024 API
BuiltInFailures.FamilyFailures.TypeRecursiveElementIdParameter Property
 Type's parameter cannot recursively point to the type itself.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TypeRecursiveElementIdParameter { get; }
Visual Basic
Public Shared ReadOnly Property TypeRecursiveElementIdParameter As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TypeRecursiveElementIdParameter {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace